## Praktikum 1

In [1]:
#List
fruits=[] #empty list
fruits=["apple","banana"] #list with 2 elements
another_list=["this is string",10]#list with different type of elements

print(fruits)
print(another_list)

combined=[fruits,another_list]
print(combined)

['apple', 'banana']
['this is string', 10]
[['apple', 'banana'], ['this is string', 10]]

In [2]:
#add element to a list
fruits=["apple","banana"]
fruits.append("orange") #append is syntax to add
print(fruits)

fruits=fruits+["mango"]
print(fruits)

['apple', 'banana', 'orange']
['apple', 'banana', 'orange', 'mango']

In [3]:
#Tuple
#tuple is similar to list but immutable once created
#1. list bisa ditambahkan isinya, kalau tuple gak bisa
#2. list bisa gabungan tipe datanya : string, numerik, dll ;
#3. list pakai kurung siku, tuple kurung biasa, set pakai 

coordinate=(0,5)
colors=("red","green","blue")
print(coordinate)
print(colors)

(0, 5)
('red', 'green', 'blue')

In [4]:
### data integration
import pandas as pd
import numpy as np

In [7]:
##merging
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})
result1=pd.merge(left,right, on='key')
result1

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [10]:
#multiple key
left=pd.DataFrame({'key1':['K0','K0','K1','K2'],
                   'key2':['K0','K1','K0','K1'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key1':['K0','K1','K1','K2'],
                    'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})
result2=pd.merge(left,right,on=['key1','key2'])
result2

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [ ]:
#export data
#cara menggabungkan 2 file ke 1 data
#misal
#movie1=pd.read_csv("tempat data tersimpan")
#movie2=pd.read_csv("tempat data tersimpan")
#gabungkan :
#movie_complete=pd.merge(movie1,movie2,on='movie_code')
#movie_complete,head()

In [22]:
data1=pd.read_csv("1.csv",sep=";")
data2=pd.read_csv("2.csv",sep=";")
data1

   no  name class  nilai
0   1   ari     A      6
1   2   ara     B      7
2   3   aru     A      8
3   4  arum     B      9
4   5   are     B     10

In [23]:
data_complate=pd.merge(data1,data2,on='no')
data_complate.head()

   no  name class  nilai          hobi warna favorit
0   1   ari     A      6      berenang          biru
1   2   ara     B      7         makan         merah
2   3   aru     A      8      mewarnai         hitam
3   4  arum     B      9    menggambar          ungu
4   5   are     B     10  bermain bola        coklat